W6/D5/ninety9cats/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)
        if @cat.save
---
INSERT INTO "cats" ("birthdate", "color", "name", "sex", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
        @cat = Cat.find(params[:id])
        if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "cats" SET "name" = ?, "color" = ?, "description" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["name", "Crookshanks"], ["color", "orange"], ["description", "Hogwarts cat"], ["updated_at", "2020-08-14 20:42:00.868901"], ["id", 14]]

    def destroy
        @cat = Cat.find(params[:id])
        @cat.destroy
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = ?  [["id", 14]]