W8/reddit-clone/app/controllers/application_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def is_moderator?
        @sub = Sub.find(params[:id])