W8/reddit-clone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        @post.sub_ids = [1,2]
        debugger
        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "I like sports games"], ["url", "www.easports.com"], ["content", "sports"], ["author_id", 1], ["created_at", "2020-08-24 21:19:40.542435"], ["updated_at", "2020-08-24 21:19:40.542435"]]