W8/reddit-clone/app/controllers/subs_controller.rb

    def update
        @sub = Sub.find(params[:id])
        if @sub.update_attributes(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "FifaOfficial"], ["description", "Official Subreddit for Fifa"], ["updated_at", "2020-08-24 18:20:09.831930"], ["id", 1]]