W7/D2/jukebox/app/controllers/artists_controller.rb

    def create
        @artist = Artist.new(artist_params)
        if @artist.save
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Roddy Rich"], ["created_at", "2020-08-18 19:26:39.397152"], ["updated_at", "2020-08-18 19:26:39.397152"]]

    def update
        @artist = Artist.find(params[:id])
        if @artist.update(artist_params)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artists" SET "name" = $1, "updated_at" = $2 WHERE "artists"."id" = $3  [["name", "Gunna"], ["updated_at", "2020-08-18 19:40:39.952880"], ["id", 1]]

    def destroy
        @artist = Artist.find(params[:id])
        @artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 1]]