W8/reddit-clone/app/views/subs/show.html.erb


<%@sub.posts.each do |post|%>
---
SELECT "posts".* FROM "posts" INNER JOIN "sub_posts" ON "posts"."id" = "sub_posts"."post_id" WHERE "sub_posts"."sub_id" = $1  [["sub_id", 1]]