W8/reddit-clone/app/views/posts/new.html.erb

    <h3>Post to:</h3>
    <%Sub.all.each do |sub|%>
---
SELECT "subs".* FROM "subs"