W6/D3/RoutesAndControllers/first_routes_and_rails/app/controllers/artworks_controller.rb

    def index
        if params[:user_id]
        # index of nested resource
            # current_user = User.find(params[:user_id])
            # @artworks = current_user.artworks
            # @artworks_shared = current_user.viewed_artworks
            @artworks = Artwork.joins(:shares)
            .where("artworks.artist_id = #{params[:user_id]} OR artwork_shares.viewer_id = #{params[:user_id]}")
        else
            @artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artworks.artist_id = :user_id OR artwork_shares.viewer_id = :user_id)
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 5]]

    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "Dogs"], ["id", 4]]