W6/D3/RoutesAndControllers/first_routes_and_rails/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE (comments.commenter_id = 10)
---
    def index
        if params.has_key?(:user_id)
        # index of nested resource
            # current_user = User.find(params[:user_id])
            # @comments = current_user.comments
            # @comments_shared = current_user.viewed_comments
            @comments = Comment.where("comments.commenter_id = #{params[:user_id]}")
        elsif params.has_key?(:artwork_id)
            @comments = Comment.where("comments.artwork_id = #{params[:artwork_id]}")
        else
            @comments = Comment.all

INSERT INTO "comments" ("body", "commenter_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Omg birds are so cool"], ["commenter_id", 10], ["artwork_id", 8], ["created_at", "2020-08-13 18:41:13.229860"], ["updated_at", "2020-08-13 18:41:13.229860"]]
---
    def create
        comment = Comment.new(comment_params)
        if comment.save