W6/D3/RoutesAndControllers/first_routes_and_rails/app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE (likes.likeable_id = 9 AND likes.likeable_type = 'Artwork')
---
    def index
        if params[:user_id]
            @likes = Like.where("likes.user_id = #{params[:user_id]}")
        elsif params[:artwork_id]
            @likes = Like.where("likes.likeable_id = #{params[:artwork_id]} AND likes.likeable_type = 'Artwork'")
        elsif params[:comment_id]
            @likes = Like.where("likes.likeable_id = #{params[:comment_id]} AND likes.likeable_type = 'Comment'")
        else
            @likes = Like.all