W6/D3/RoutesAndControllers/first_routes_and_rails/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "ooissuspended@gmail.com"], ["id", 4]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)