W7/D2/jukebox/app/models/user.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "5pyD2N1GZukeMPHd13gW_w"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save!